{
  "header": {
    "home": "Startseite",
    "about": "Über mich",
    "gallery": "Kunstwerke",
    "contact": "Kontakt",
    "intro": "Willkommen in meiner Kunstgalerie!",
    "intro1": "Betreten Sie ein Universum, in dem jeder Pinselstrich eine Emotion offenbart, jede Farbe eine Geschichte flüstert und jede Leinwand zu einem Moment wird, der zwischen Traum und Realität schwebt.",
    "learnMore": "Mehr erfahren",
    "login": "Login",
    "logout": "Logout"
  },
  "about": {
    "title": "Über mich",
    "text": "Für mich ist Malerei ein Mittel zur Kommunikation mit mir selbst. Sie ermöglicht es mir, meine Gefühle auszudrücken und gleichzeitig meiner Kreativität freien Lauf zu lassen. Ich möchte andere durch meine Kunst ermutigen und positive Energie, Lebensfreude, Liebe und Freude verbreiten. Meine Bilder sind vor allem vom menschlichen Leben, seinen Prozessen, seiner Kultur und der Natur inspiriert und sollen Menschen motivieren. Malen war schon immer meine große Leidenschaft.",
    "text1": "Ich arbeite in verschiedenen Stilen, darunter abstrakt, abstrakter Realismus, Semi-Porträts und Illustrationen. Ich weiß, dass es viele verschiedene Malstile gibt, aber ich genieße diese Vielfalt. Mich auf einen einzigen Stil zu beschränken, kann etwas eintönig sein. Deshalb freue ich mich darauf, meine Ideen durch meine Kunst zu teilen.",
    "text2": "Ich hoffe aufrichtig, dass meine Bilder Ihnen Freude und Glück bringen."
  },
  "cart": {
      "title": "Warenkorb",
      "empty": "Ihr Warenkorb ist leer",
      "total": "Gesamt:",
      "delete": "Löschen",
      "checkout": "Zur Kasse"
    },
  "gallery": {
      "title": "Kunstwerke",
      "addPaint": "Neue Kunstwerke hochladen",
      "add": "Hinzufügen",
      "close": "Schließen",
      "chooseFile": "Wählen Sie eine Datei aus",
      "addToCart": "In den Warenkorb"
    },
  "contact": {
    "title": "Kontakt",
    "text": "Zögern Sie nicht, mich per E-Mail oder Telefon unten zu kontaktieren oder das Kontaktformular auszufüllen.",
    "name": "Nachname:",
    "firstName": "Vorname:",
    "phone": "Telefonnummer:",
    "mail": "E-Mail:",
    "object": "Betreff:",
    "message": "Nachricht:",
    "submit": "Senden"
  },
  "footer": {
    "rights": "Alle Rechte vorbehalten."
  }
}
